import useStyle from "../style";
import {Button, Typography} from "@mui/material";
import CardsStack from "../../../CardsStackComponent/cardsStack";
import {AddOutlined} from "@mui/icons-material";

const MySetsPageContent = () => {
    const classes = useStyle();
    const info = [
        {
            title: "Test card1",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card2",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card3",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card4",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card5",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card6",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card7",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card8",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card9",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card10",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card11",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card12",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card13",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card14",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card15",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card16",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card17",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card18",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card19",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card20",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card21",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card22",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card23",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card24",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card25",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card26",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card27",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card28",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card29",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card30",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card31",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card32",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        },];
    return (
        <div
            className={classes.pageContainer}>
            <div
                className={classes.headerContainer}>
                <Typography
                    variant={"h4"}>
                    My Sets
                </Typography>
                <Button
                    variant={"contained"}
                    size={"large"}
                    endIcon={<AddOutlined/>}>
                    Add new set
                </Button>
            </div>
            <CardsStack
                info={info}/>
        </div>);
}

export default MySetsPageContent;