import useStyle from "./style";
import {Button, TextField, Typography} from "@mui/material";
import CardsStack from "../../../CardsStackComponent/cardsStack";
import {useState} from "react";

const AllSetsPageContent = () => {
    const classes = useStyle();
    const info = [{
        title: "Test card1",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card2",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card3",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card4",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card5",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card6",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card7",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card8",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card9",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    },];
    const [state, setState] = useState({
        input: "",
        filteredResults: info
    });
    const onTextInputChanged = (text) => {
        setState({
            input: text,
            filteredResults: info.filter(element => element.title.includes(text))
        })
        console.log(text)
    }
    return (
        <div className={classes.pageContainer}>
            <Typography variant={"h4"}>All Sets</Typography>
            <div className={classes.inputContainer}>
                <TextField variant={"outlined"} className={classes.searchBarClass}
                           onChange={(event) => onTextInputChanged(event.target.value)}
                           placeholder={"Search for new sets"}/>
            </div>
            <CardsStack info={state.filteredResults}/>
        </div>
    )
}

export default AllSetsPageContent;