import useStyle from "./style";
import {Button, TextField, Typography} from "@mui/material";
import CardsStack from "../../../CardsStackComponent/cardsStack";
import {useState} from "react";

const AllSetsPageContent = () => {
    const classes = useStyle();
    const info = [{
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    }, {
        title: "Test card",
        description: "Test description",
        kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
    },];
    const [state, setState] = useState({
        input: "",
        filteredResults: info
    });
    const onTextInputChanged = (text) => {
        setState(prevState => ({
            input: text,
            filteredResults: prevState.filteredResults
        }))
    }
    const onSearchClicked = () => {
        setState(prevState => ({
            input: prevState.input,
            filteredResults: info.filter(element => element.title.includes(state.input))
        }))
    }
    return (
        <div className={classes.pageContainer}>
            <Typography variant={"h4"}>All Sets</Typography>
            <div className={classes.inputContainer}>
                <TextField variant={"outlined"} className={classes.searchBarClass}
                           onChange={(event) => onTextInputChanged(event.target.value)} placeholder={"Search for new sets"}/>
                <Button variant={"contained"} className={classes.buttonClass} onClick={() => onSearchClicked()} size={"large"}>
                    Search
                </Button>
            </div>
            <CardsStack info={state.filteredResults}/>
        </div>
    )
}

export default AllSetsPageContent;