import useStyle from "./style";
import PropTypes from "prop-types";
import Card from "../CardComponent/card";

const CardsStack = (props) => {
    const classes = useStyle();
    const info = props.info || [
        {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        }, {
            title: "Test card",
            description: "Test description",
            kanji: ["日", "本", "語", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね", "は", "と", "て", "も", "面", "白", "い", "だ", "ね"]
        },]
    return (
        <div className={classes.container}>
            {info.map(element =>
                <Card cardName={element.title} cardDescription={element.description} kanji={element.kanji}/>
            )}
        </div>
    )
}

CardsStack.propTypes = {
    info: PropTypes.arrayOf(PropTypes.objectOf({
        title: PropTypes.string.isRequired,
        description: PropTypes.string.isRequired,
        kanji: PropTypes.arrayOf(PropTypes.string.isRequired).isRequired
    }).isRequired).isRequired
}

export default CardsStack;